000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СтруктураУзлов/СтруктураУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураУзлов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>MSDyn_CRM</name>
      <description>MS Dynamics CRM</description>
    </items>
    <items>
      <name>КСУ_Navision</name>
      <description>Корпоративная Система Управления (внешний источник Navision)</description>
    </items>
    <items>
      <name>ЦентральныйОфис</name>
      <description>ЦЕНТРАЛЬНЫЙ ОФИС</description>
    </items>
  </predefined>
  <attributes>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУзла</name>
    <type>
      <types>EnumRef.ВидыУзлов</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловОбновления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловРезервныхКопий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрограммы</name>
    <type>
      <types>EnumRef.ПрограммаМобильногоУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧрезвычайноеПоложение</name>
    <comment>Вне доступа из-за войны</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <comment>Алгоритм, назначенный для выполнения в текущем узле</comment>
      <type>
        <types>CatalogRef.Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьАлгоритм</name>
      <type>
        <types>EnumRef.ВыполнятьАлгоритм</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Магазины</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизвольныеДанные</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезервныеКопии</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетевыеИнтерфейсы</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыУзлов/ВидыУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУзлов</name>
  <enumValues>
    <name>ЦентральныйОфис</name>
  </enumValues>
  <enumValues>
    <name>Магазин</name>
  </enumValues>
  <enumValues>
    <name>ИнтернетМагазин</name>
  </enumValues>
  <enumValues>
    <name>ПустойУзел</name>
  </enumValues>
  <enumValues>
    <name>КСУ_Navision</name>
  </enumValues>
  <enumValues>
    <name>ТестовыйУзел</name>
    <comment>В него всё едет, а из него ничего не выгружается.</comment>
  </enumValues>
  <enumValues>
    <name>УзелРРО</name>
    <comment>Энергонезависимая касса</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоМобильное</name>
  </enumValues>
  <enumValues>
    <name>УзелРасчёта</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СтруктураУзлов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТаблицаРолей.Параметры.УстановитьЗначениеПараметра("Пользователь" , "");
	ТаблицаРолей.Параметры.УстановитьЗначениеПараметра("ТекущаяСсылка", Объект.Ссылка);

	Элементы.СтраницаПараметрыСоединения.Видимость =
		Объект.ВидУзла = Перечисления.ВидыУзлов.КСУ_Navision
		И Объект.Предопределенный
		И ОбменДаннымиПовтИсп.ЭтоГлавныйУзел();

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("СтруктураУзлов.ЗаписанЭлемент", Объект.Ссылка, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ТаблицаРолей.Параметры.УстановитьЗначениеПараметра("ТекущаяСсылка", ТекущийОбъект.Ссылка);
	Элементы.ТаблицаРолей.Обновить();
	УстановитьОформлениеЭлементов();

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПользователиПриАктивизацииСтроки(Элемент)

	Параметр = "";

	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда

		Параметр = Элемент.ТекущиеДанные.Имя;

	КонецЕсли;

	ТаблицаРолей.Параметры.УстановитьЗначениеПараметра("Пользователь", Параметр);

	Элемент.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СужебныйКаталогФайловОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Каталог   = Объект[Элемент.Имя];
	ДиалогВыбора.Заголовок = "Укажите каталог, в котором будут размещаться файлы"
		+ ?(Элемент.Имя = "КаталогФайловОбновления"    , " обновления (*.cfu):"
		, ?(Элемент.Имя = "КаталогФайловРезервныхКопий", " резервных копий (*.bak):", ":"));

	Если ДиалогВыбора.Выбрать() Тогда

		Объект[Элемент.Имя] = ДиалогВыбора.Каталог;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте	//	LNK 11.04.2022 07:32:50
Процедура ЧрезвычайноеПоложениеПриИзменении(Элемент)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

#Область СлужебныеПроцедурыФункции

&НаСервере	//	LNK 11.04.2022 07:40:18
Процедура УстановитьОформлениеЭлементов()

	Элементы.ЧрезвычайноеПоложение.ЦветТекстаЗаголовка = ?(Объект.ЧрезвычайноеПоложение
		, ЦветаСтиля.ЦветНепроведенногоДокумента
		, Новый Цвет)
	;

КонецПроцедуры

#КонецОбласти
